<details ><summary>apply for core 2025-03-05 22:52:36 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project LumeWeb/lumeportal.com-devops#core has been locked by PR #1
</details>

<details ><summary>Apply output</summary>

```terraform
OpenTofu will perform the following actions:

  # cloudns_dns_record.renterd will be updated in-place
  ~ resource "cloudns_dns_record" "renterd" {
        id    = "583905066"
        name  = "lumeportal-core-renterd-solo.node"
      ~ value = "17tiqm9lctauf0kts5cdd0a9vo.ingress.ny-01.node.infra.lumeweb.com" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # cloudns_dns_record.renterd_s3 will be updated in-place
  ~ resource "cloudns_dns_record" "renterd_s3" {
        id    = "583905068"
      ~ name  = "17tiqm9lctauf0kts5cdd0a9vo.ingress.ny-01.node.infra.lumeweb.com" -> (known after apply)
      ~ value = "17tiqm9lctauf0kts5cdd0a9vo.ingress.ny-01.node.infra.lumeweb.com" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.etcd.module.etcd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.mysql.module.mysql_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.renterd.module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 3 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ etcd_endpoint       = "http://provider.ny-01.node.infra.lumeweb.com:31265" -> (known after apply)
  ~ mysql_endpoint      = "provider.ny-01.node.infra.lumeweb.com:30157" -> (known after apply)
  ~ renterd_s3_endpoint = "lumeportal-core-renterd-solo.node.lumeportal.com:30759" -> (known after apply)
module.etcd.module.etcd_deployment.akash_deployment.service: Creating...
module.etcd.module.etcd_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.etcd.module.etcd_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.etcd.module.etcd_deployment.akash_deployment.service: Creation complete after 26s [id=20511792:1:1:akash1nd8v8nc9ufzguwg3yu4fm9q02q72r6y4fhwkg2:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.mysql.module.mysql_deployment.akash_deployment.service: Creating...
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [30s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Creation complete after 30s [id=20511796:1:1:akash1nd8v8nc9ufzguwg3yu4fm9q02q72r6y4fhwkg2:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.renterd.module.renterd_deployment.akash_deployment.service: Creating...
module.renterd.module.renterd_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.renterd.module.renterd_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.renterd.module.renterd_deployment.akash_deployment.service: Creation complete after 29s [id=20511801:1:1:akash1nd8v8nc9ufzguwg3yu4fm9q02q72r6y4fhwkg2:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
cloudns_dns_record.renterd_s3: Modifying... [id=583905068]
cloudns_dns_record.renterd: Modifying... [id=583905066]
cloudns_dns_record.renterd_s3: Modifications complete after 0s [id=583905068]
cloudns_dns_record.renterd: Modifications complete after 1s [id=583905066]

Apply complete! Resources: 3 added, 2 changed, 0 destroyed.

Outputs:

base_domain = "lumeportal.com"
environment = "prod"
etcd_endpoint = "http://provider.ny-01.node.infra.lumeweb.com:32274"
etcd_password = <sensitive>
etcd_username = <sensitive>
mysql_endpoint = "provider.ny-01.node.infra.lumeweb.com:30768"
renterd_endpoint = "lumeportal-core-renterd-solo.node.lumeportal.com"
renterd_s3_endpoint = "lumeportal-core-renterd-solo.node.lumeportal.com:31375"

```
</details>

</details>